<a href="https://colab.research.google.com/github/jonnie763/DATA-690-Data-Structures-and-Algorithms/blob/main/hw_11_rius_jonathan.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Do the following for your assignment:
Create a list of Pandas Series
"first_name": ["jane", "john", "jasmine", "teddy", "megan", "jeffrey", "edward", "jaime"]
"last_name": ["olsen", "Totti", "kennedy", "roosevelt", "fox", "bridges", "scissorhand", "cox"]
"age": [34, 28, 13, 45, 51, 36, 18, 65]

Create a new DataFrame named customer using the above list of Pandas Series
The column names will come from the keys above ("first_name", "last_name", "age).

Use the following selection and indexing techniques to create new DataFrames

Using masking, select list of customers who are between 20 and 35 in age

**Using slicing, select every other row.**

**Using fancy indexing, create a new DataFrame with only "last_name" and "age" columns**

Using implicit indexing attribute and slicing, create a new DataFrame with indices between 2 and 5.

Create a new DataFrame named customer_amount_nan  by add another Pandas Series with following data (in addition to the list of series from above)
"total_sales": [32.10, 50.80, 13.00, 98.21, NaN, 0.50, None, 77.01]

Using forward fill, fill the missing values

Using backward fill, fill the missing values

Fill the missing values with value of 0.00

## 1. Creating the Dataframe from the Pandas Series.

In [11]:
import pandas as pd
import matplotlib.pyplot as plt
  
first_name = ["jane", "john", "jasmine", "teddy", "megan", "jeffrey", "edward", "jaime"] # Creating the data frames manually 

last_name = ["olsen", "Totti", "kennedy", "roosevelt", "fox", "bridges", "scissorhand", "cox"]

age= [34,28,13,45,51,36,18,65]
  
age_series = pd.Series(age) # Creating the Series 

fname_series = pd.Series(first_name)

lname_series = pd.Series(last_name)
  
frame = { 'Age': age_series, 'First Name': fname_series, 'Last Name':lname_series} # Converting the series to dataframes 
  
result = pd.DataFrame(frame)
  
result

   Age First Name    Last Name
0   34       jane        olsen
1   28       john        Totti
2   13    jasmine      kennedy
3   45      teddy    roosevelt
4   51      megan          fox
5   36    jeffrey      bridges
6   18     edward  scissorhand
7   65      jaime          cox

## 2. Include only a range of ages using masking.

In [12]:
result_index=result.drop(columns=['First Name', 'Last Name']) # The code below will not work unless you only include columns with integers

result_index[(result_index> 20) & (result_index < 35)] # Can figure out consumer names by slicing and using code result[0:2]

    Age
0  34.0
1  28.0
2   NaN
3   NaN
4   NaN
5   NaN
6   NaN
7   NaN

## 3. Using slicing, select every other row.

In [13]:
result.iloc[[1, 3, 5,7]] # Explicit slice by choosing every other row ( all odd rows)

   Age First Name  Last Name
1   28       john      Totti
3   45      teddy  roosevelt
5   36    jeffrey    bridges
7   65      jaime        cox

## 4. Using fancy indexing, create a new DataFrame with only "last_name" and "age" columns.

In [14]:
df1 = result[['Age','Last Name']] # Selected rows are last name and age
df1

   Age    Last Name
0   34        olsen
1   28        Totti
2   13      kennedy
3   45    roosevelt
4   51          fox
5   36      bridges
6   18  scissorhand
7   65          cox

## 5. Using implicit indexing attribute and slicing, create a new DataFrame with indices between 2 and 5.

In [15]:
result[2:5] # Implict indexing integer

   Age First Name  Last Name
2   13    jasmine    kennedy
3   45      teddy  roosevelt
4   51      megan        fox

In [16]:
result[2:6] # Directions may have wanted this instead

   Age First Name  Last Name
2   13    jasmine    kennedy
3   45      teddy  roosevelt
4   51      megan        fox
5   36    jeffrey    bridges

## 6. Create new dataframe and add in values.

In [17]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
  
first_name = ["jane", "john", "jasmine", "teddy", "megan", "jeffrey", "edward", "jaime"] # Same procedure as first cell of code (with total sales)

last_name = ["olsen", "Totti", "kennedy", "roosevelt", "fox", "bridges", "scissorhand", "cox"]

total_sales=[32.10, 50.80, 13.00, 98.21, np.nan, 0.50, None, 77.01]

age= [34,28,13,45,51,36,18,65]

total_sales_series= pd.Series(total_sales)
  
age_series = pd.Series(age)

fname_series = pd.Series(first_name)

lname_series = pd.Series(last_name)
  
frame = { 'Age': age_series, 'First Name': fname_series, 'Last Name':lname_series,'Total Sale':total_sales_series}
  
result = pd.DataFrame(frame)
  
result

   Age First Name    Last Name  Total Sale
0   34       jane        olsen       32.10
1   28       john        Totti       50.80
2   13    jasmine      kennedy       13.00
3   45      teddy    roosevelt       98.21
4   51      megan          fox         NaN
5   36    jeffrey      bridges        0.50
6   18     edward  scissorhand         NaN
7   65      jaime          cox       77.01

In [18]:
result.ffill(axis = 0) # Forward fill

   Age First Name    Last Name  Total Sale
0   34       jane        olsen       32.10
1   28       john        Totti       50.80
2   13    jasmine      kennedy       13.00
3   45      teddy    roosevelt       98.21
4   51      megan          fox       98.21
5   36    jeffrey      bridges        0.50
6   18     edward  scissorhand        0.50
7   65      jaime          cox       77.01

In [19]:
result.bfill(axis ='rows') # Back fill

   Age First Name    Last Name  Total Sale
0   34       jane        olsen       32.10
1   28       john        Totti       50.80
2   13    jasmine      kennedy       13.00
3   45      teddy    roosevelt       98.21
4   51      megan          fox        0.50
5   36    jeffrey      bridges        0.50
6   18     edward  scissorhand       77.01
7   65      jaime          cox       77.01

In [20]:
result.fillna(0) # fill with zero

   Age First Name    Last Name  Total Sale
0   34       jane        olsen       32.10
1   28       john        Totti       50.80
2   13    jasmine      kennedy       13.00
3   45      teddy    roosevelt       98.21
4   51      megan          fox        0.00
5   36    jeffrey      bridges        0.50
6   18     edward  scissorhand        0.00
7   65      jaime          cox       77.01